/*
import 'package:flutter/material.dart';

List<Map<String, dynamic>> centersData = [
  {
    "id": 1,
    "name": "مركز جنة لرعاية ذوي الاحتياجات الخاصة",
    "imageUrl": "https://j.top4top.io/p_3353gcqca0.jpg",
    "description": "يقدم المركز خدمات رعاية وتأهيل شاملة للأطفال ذوي الاحتياجات الخاصة، مع برامج تعليمية وتدريبية متخصصة.",
    "services": [
      {
        "name": "الإعاقة الذهنية",
        "subServices": [
          "برامج تعليمية وتأهيلية",
          "توفير الدعم للأسر",
        ],
      },
      {
        "name": "اضطرابات التوحد",
        "subServices": [
          "برامج تعليمية وتأهيلية للأطفال المصابين بالتوحد",
          "دعم نفسي وتدريب للأهالي",
        ],
      },
      {
        "name": "الدعم العام لذوي الاحتياجات الخاصة",
        "subServices": [
          "توفير برامج توعوية للأسر",
          "تقديم خدمات الرعاية اليومية للأطفال",
        ],
      },
    ],
    "location": {
      "latitude": 15.378050,
      "longitude": 44.205238,
    },
    "address": "صنعاء ـ الحصبة ـ أمام اللجنة الدائمة",
    "contactNumber": "770402500",
    "whatsappNumber": "770402500",
  },
  {
    "id": 2,
    "name": "مركز التأهيل التعليمي والمهني لذوي الاحتياجات الخاصة",
    "imageUrl": "https://evrcsn.com/storage/images/%D9%85%D8%B1%D9%83%D8%B2%20%D8%A7%D9%84%D8%AA%D8%A7%D9%87%D9%8A%D9%84%20%20%D8%B5%D9%88%D8%B1%D8%A9_2.jpg",
    "description": "يقدم المركز برامج تعليمية ومهنية لذوي الاحتياجات الخاصة، بهدف دمجهم في المجتمع وتعزيز مهاراتهم الحياتية.",
    "services": [
      {
        "name": "الإعاقة السمعية",
        "subServices": [
          "تعليم القراءة والكتابة بطريقة برايل",
          "تعليم لغة الإشارة للصم",
          "التدريب على استخدام الأجهزة التعويضية"
          "الدمج التعليمي والمهني للصم والبكم"
        ],
      },
      {
        "name": "الإعاقة الذهنية",
        "subServices": [
          "تعليم مهارات الحياة اليومية",
          "التدريب على الحرف اليدوية",
        ],
      },
    ],
    "location": {
      "latitude": 15.360445,
      "longitude": 44.191006,
    },
    "address": "صنعاء - بني الحارث - صرف - الأحضان",
    "contactNumber": "01340724",
    "whatsappNumber": "770044350",
  },
  {
    "id": 3,
    "name": "مؤسسة البسمة لذوي الاحتياجات الخاصة",
    "imageUrl": "https://j.top4top.io/p_3353k7kyu1.jpg",
    "description": "تسعى المؤسسة إلى تقديم الدعم والرعاية لذوي الاحتياجات الخاصة من خلال برامج تعليمية وتأهيلية متنوعة.",
    "services": [
      {
        "name": "الإعاقة الحركية",
        "subServices": [
          "ورش عمل لتأهيل الأطفال المصابين بضمور العضلات",
          "برامج دعم نفسي وتأهيل اجتماعي",
        ],
      },
      {
        "name": "متلازمة داون",
        "subServices": [
          "دعم نفسي وتأهيلي للأطفال وأسرهم",
          "توفير فرص دمج اجتماعي",
        ],
      },
    ],
    "location": {
      "latitude": 15.3489,
      "longitude": 44.2061,
    },
    "address": "صنعاء - شارع الزبيري - جوار مستشفى الثورة",
    "contactNumber": "01234567",
    "whatsappNumber": "771234567",
  },
  {
    "id": 4,
    "name": "مؤسسة التعاون الإنساني لرعاية ذوي الاحتياجات الخاصة",
    "imageUrl": "https://a.top4top.io/p_3353b65zy0.jpg",
    "description": "تقدم المؤسسة خدمات رعاية وتأهيل لذوي الاحتياجات الخاصة، بالإضافة إلى مبادرات إنسانية لدعم الأسر المحتاجة.",
    "services": [
      {
        "name": "الإعاقة البصرية",
        "subServices": [
          "توفير النظارات الطبية الخاصة",
          "تقديم أجهزة مساعدة مثل الطابعات البرايل",
        ],
      },
      {
        "name": "الدعم العام لذوي الاحتياجات الخاصة",
        "subServices": [
          "جلسات مجانية للعلاج الطبيعي",
          "دعم غذائي وصحي للأسر المحتاجة",
        ],
      },
    ],
    "location": {
      "latitude": 15.3694,
      "longitude": 44.1910,
    },
    "address": "صنعاء - حي الحصبة - شارع عمران",
    "contactNumber": "01234568",
    "whatsappNumber": "772345678",
  },
  {
    "id": 5,
    "name": "مركز الإرادة لإعادة التأهيل",
    "imageUrl": "https://l.top4top.io/p_3353rvkru4.jpg",
    "description": "يقدم المركز خدمات التشخيص والعلاج الوظيفي والنطقي، بالإضافة إلى برامج التربية الخاصة والعلاج الطبيعي.",
    "services": [
      {
        "name": "الإعاقة السمعية",
        "subServices": [
          "الفحوصات السمعية المتقدمة",
          "جلسات التخاطب وتحسين النطق",
          "برامج دعم نفسي وتأهيلي",
        ],
      },
      {
        "name": "الإعاقة الحركية",
        "subServices": [
          "توفير الجبائر والمساند الطبية",
          "تأهيل الأطفال المصابين بالشلل الدماغي",
          "توفير العلاج الوظيفي لتحسين المهارات الحركية",
        ],
      },
      {
        "name": "اضطرابات النطق والتواصل",
        "subServices": [
          "تقنيات متقدمة في تخاطب الأطفال والكبار",
          "تدريب على استخدام أجهزة النطق البديلة",
        ],
      },
      {
        "name": "اضطرابات تشتت الانتباه وفرط النشاط (ADHD)",
        "subServices": [
          "برامج تنظيم الوقت وتحفيز التركيز",
          "الدعم الأكاديمي والسلوكي للأطفال",
        ],
      },
    ],
    "location": {
      "latitude": 15.3765,
      "longitude": 44.2145,
    },
    "address": "صنعاء - شارع 45 - جولة الصافية",
    "contactNumber": "01543210",
    "whatsappNumber": "773210987",
  },
  {
    "id": 6,
    "name": "مركز الحكيم التخصصي للتشخيص وتأهيل ذوي الإحتياجات الخاصة",
    "imageUrl": "https://f.top4top.io/p_3353ezpv41.jpg",
    "description": "يقدم المركز خدمات تشخيصية وتأهيلية متخصصة لذوي الاحتياجات الخاصة، بما في ذلك اضطرابات النطق والتوحد وتشتت الانتباه.",
    "services": [
      {
        "name": "الإعاقة السمعية",
        "subServices": [
          "التشخيص المبكر لحالات ضعف السمع",
          "تعليم لغة الإشارة",
          "تدريب النطق وتحسين المهارات اللغوية",
          "تركيب السماعات الطبية وبرامج التأهيل السمعي",
        ],
      },
      {
        "name": "الإعاقة البصرية",
        "subServices": [
          "التشخيص البصري وتقييم درجات الإعاقة",
          "التدريب على استخدام العصا البيضاء",
          "تعليم الكتابة والقراءة بطريقة برايل",
          "التأهيل الحركي لضعاف البصر"
        ],
      },
      {
        "name": "الإعاقة الحركية",
        "subServices": [
          "العلاج الطبيعي والتأهيلي",
          "برامج رياضية علاجية",
          "تدريب على استخدام الكراسي المتحركة",
        ],
      },
      {
        "name": "الإعاقة الذهنية",
        "subServices": [
          "تعديل السلوكيات الخاطئة",
          "برامج تنمية المهارات العقلية والإدراكية",
          "التعليم والتأهيل المهني",
        ],
      },
      {
        "name": "اضطرابات النطق والتواصل",
        "subServices": [
          "جلسات علاجية للنطق وتحسين التواصل",
          "برامج تأهيلية للأطفال الذين يعانون من تأخر النطق",
        ],
      },
      {
        "name": "اضطرابات التوحد",
        "subServices": [
          "التشخيص والتقييم",
          "العلاج السلوكي المعرفي",
          "التأهيل المهني للأطفال المصابين بالتوحد",
        ],
      },
      {
        "name": "اضطرابات تشتت الانتباه وفرط النشاط (ADHD)",
        "subServices": [
          "تعديل السلوكيات",
          "برامج تعليمية متخصصة",
          "جلسات علاج معرفي سلوكي",
        ],
      },
      {
        "name": "متلازمة داون",
        "subServices": [
          "برامج تعليمية وتأهيلية متخصصة",
          "تنمية المهارات الحياتية والاجتماعية",
        ],
      },
    ],
    "location": {
      "latitude": 15.369445,
      "longitude": 44.191006,
    },
    "address": "صنعاء - شارع الدائري - جولة كنتاكي - برج القديمي الطبي - الدور الثاني",
    "contactNumber": "01209725",
    "whatsappNumber": "777216770",
  },





];



*/